output/posts/rust-macro/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Rust macro | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/rust-macro/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../rust-c-ffi/" title="rust c ffi" type="text/html">
<link rel="next" href="../pblas-scalapack/" title="PBLAS &amp; ScaLAPACK &amp; BLACS" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="Rust macro">
<meta property="og:url" content="https://chimez.github.io/posts/rust-macro/">
<meta property="og:description" content="Rust 宏


Rust 的宏分为两类，一种是声明宏 macro_rules! ,另一种是过程宏 #[...] .





声明宏 macro_rules!


声明宏是 Rust 中最常用的宏，通过对源码的模式匹配来实现功能。




语法


参考： reference/macro



#[macro_export] 导出宏
$x:expr 表明模式匹配一个 expr 类型的源码块，并用">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-08-20T13:32:43+08:00">
<meta property="article:tag" content="macro">
<meta property="article:tag" content="rust">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Rust macro</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-08-20T13:32:43+08:00" itemprop="datePublished" title="2021-08-20 13:32">2021-08-20 13:32</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org9e21e83" class="outline-2">
<h2 id="org9e21e83">Rust 宏</h2>
<div class="outline-text-2" id="text-org9e21e83">
<p>
Rust 的宏分为两类，一种是声明宏 <code>macro_rules!</code> ,另一种是过程宏 <code>#[...]</code> .
</p>
</div>


<div id="outline-container-org00438ff" class="outline-3">
<h3 id="org00438ff">声明宏 <code>macro_rules!</code>
</h3>
<div class="outline-text-3" id="text-org00438ff">
<p>
声明宏是 Rust 中最常用的宏，通过对源码的模式匹配来实现功能。
</p>
</div>

<div id="outline-container-org0eabae1" class="outline-4">
<h4 id="org0eabae1">语法</h4>
<div class="outline-text-4" id="text-org0eabae1">
<p>
参考： <a href="https://doc.rust-lang.org/reference/macros-by-example.html">reference/macro</a>
</p>

<ul class="org-ul">
<li>
<code>#[macro_export]</code> 导出宏</li>
<li>
<code>$x:expr</code> 表明模式匹配一个 <code>expr</code> 类型的源码块，并用 <code>$x</code> 表示它</li>
<li>
<code>$( ... ),*$</code> 表明匹配括号中的内容 0 次或多次，每个重复的内容直接由 <code>,</code> 分隔</li>
</ul>
</div>
</div>

<div id="outline-container-org9bb41e5" class="outline-4">
<h4 id="org9bb41e5">例子： <code>vec!</code>
</h4>
<div class="outline-text-4" id="text-org9bb41e5">
<div class="highlight"><pre><span></span>    #[macro_export]
    macro_rules! vec {
	( $( $x:expr ),* ) =&gt; {
	    {
		let mut temp_vec = Vec::new();
		$(
		    temp_vec.push($x);
		)*
		    temp_vec
	    }
	};
    }
</pre></div>
</div>
</div>
</div>


<div id="outline-container-org3450c30" class="outline-3">
<h3 id="org3450c30">过程宏</h3>
<div class="outline-text-3" id="text-org3450c30">
<p>
过程宏是一个函数，不过它的输入输出类型是词法对象 <code>TokenStream</code> ，由编译器在编译前调用。
</p>
</div>

<div id="outline-container-org6a0fb39" class="outline-4">
<h4 id="org6a0fb39">crate</h4>
<div class="outline-text-4" id="text-org6a0fb39">
<p>
由于技术限制，目前过程宏必须分离在一个单独的 crate 中, 这个 crate 是 <code>proc-macro</code> 类型的
</p>


<p>
<code>Cargo.toml</code>
</p>
<div class="highlight"><pre><span></span>    [lib]
    proc-macro = true
</pre></div>
</div>
</div>

<div id="outline-container-org7765bbd" class="outline-4">
<h4 id="org7765bbd">
<code>derive</code> 宏</h4>
<div class="outline-text-4" id="text-org7765bbd">
<p>
<code>derive</code> 宏用来为结构体等创建默认的 trait 实现。
</p>

<p>
下面的例子创建一个 <code>HelloMacro</code> trait 的默认实现宏。
</p>
</div>

<ul class="org-ul">
<li>
<a id="org6aec40b"></a>使用<br><div class="outline-text-5" id="text-org6aec40b">
<p>
下面的例子展示了为 <code>struct Pancakes</code> 创建 trait <code>HelloMacro</code> 的默认实现的方法，这个 trait 中只有一个函数 <code>hello_macro()</code>
</p>

<p>
<code>src/main.rs</code>
</p>
<div class="highlight"><pre><span></span>     use hello_macro::HelloMacro;
     use hello_macro_derive::HelloMacro;

     #[derive(HelloMacro)]
     struct Pancakes;

     fn main() {
	 Pancakes::hello_macro();
     }
</pre></div>
</div>
</li>

<li>
<a id="org5e35bea"></a>trait 定义<br><div class="outline-text-5" id="text-org5e35bea">
<p>
<code>hello_macro/src/lib.rs</code>
</p>
<div class="highlight"><pre><span></span>     pub trait HelloMacro {
	 fn hello_macro();
     }
</pre></div>
</div>
</li>

<li>
<a id="org8e74709"></a>宏定义<br><div class="outline-text-5" id="text-org8e74709">
<p>
<code>hello_macro_derive/Cargo.toml</code>
</p>
<div class="highlight"><pre><span></span>     [lib]
     proc-macro = true

     [dependencies]
     syn = "1.0"
     quote = "1.0"
</pre></div>

<p>
<code>hello_macro_derive/src/lib.rs</code>
</p>
<div class="highlight"><pre><span></span>     extern crate proc_macro;

     use proc_macro::TokenStream;
     use quote::quote;
     use syn;

     #[proc_macro_derive(HelloMacro)]
     pub fn hello_macro_derive(input: TokenStream) -&gt; TokenStream {
	 // Construct a representation of Rust code as a syntax tree
	 // that we can manipulate
	 let ast = syn::parse(input).unwrap();

	 // Build the trait implementation
	 impl_hello_macro(&amp;ast)
     }

     fn impl_hello_macro(ast: &amp;syn::DeriveInput) -&gt; TokenStream {
	 let name = &amp;ast.ident;
	 let gen = quote! {
	     impl HelloMacro for #name {
		 fn hello_macro() {
		     println!("Hello, Macro! My name is {}!", stringify!(#name));
		 }
	     }
	 };
	 gen.into()
     }
</pre></div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org7875d5d" class="outline-4">
<h4 id="org7875d5d">
<code>Attribute-like</code> 宏</h4>
<div class="outline-text-4" id="text-org7875d5d">
<p>
属性宏可以创建新的属性, 与 <code>derive</code> 宏的区别在于参数多了一个属性 <code>attr</code>, 也就是括号里面的部分，另一个参数 <code>item</code> 就是与 <code>derive</code> 宏一样的内容了。
</p>
</div>

<ul class="org-ul">
<li>
<a id="orgb598b7b"></a>用法<br><div class="outline-text-5" id="text-orgb598b7b">
<div class="highlight"><pre><span></span>     #[route(GET, "/")]
     fn index() { ... }
</pre></div>
</div>
</li>

<li>
<a id="org6f08530"></a>宏定义<br><div class="outline-text-5" id="text-org6f08530">
<div class="highlight"><pre><span></span>     #[proc_macro_attribute]
     pub fn route(attr: TokenStream, item: TokenStream) -&gt; TokenStream { ... }
</pre></div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org374b7a5" class="outline-4">
<h4 id="org374b7a5">
<code>Function-like</code> 宏</h4>
<div class="outline-text-4" id="text-org374b7a5">
<p>
函数宏可以定义像函数一样调用的宏。可以用来定义 DSL
</p>
</div>

<ul class="org-ul">
<li>
<a id="org02c78a4"></a>用法<br><div class="outline-text-5" id="text-org02c78a4">
<div class="highlight"><pre><span></span>     let sql = sql!(SELECT * FROM posts WHERE id=1);
</pre></div>
</div>
</li>

<li>
<a id="org6797a07"></a>宏定义<br><div class="outline-text-5" id="text-org6797a07">
<div class="highlight"><pre><span></span>     #[proc_macro]
     pub fn sql(input: TokenStream) -&gt; TokenStream { ... }
</pre></div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org04a8869" class="outline-4">
<h4 id="org04a8869">syn: rust parser</h4>
<div class="outline-text-4" id="text-org04a8869">
<p>
<a href="https://crates.io/crates/syn">syn</a> 是 rust 代码的 parser，可以将源码字符串 <code>TokenStream</code> 转换成语法树 <code>syn::DeriveInput</code> 。
</p>
</div>

<ul class="org-ul">
<li>
<a id="orga29f2d4"></a><code>syn::DeriveInput</code><br><div class="outline-text-5" id="text-orga29f2d4">
<p>
对于输入 <code>TokenStream</code> 使用 <code>parse_macro_input!</code> 将它解析为语法树 <code>DeriveInput</code> ，之后就可以通过对语法树的操作生成新的语法树
</p>
</div>
</li>

<li>
<a id="orgc25fad7"></a><code>syn::spanned::Spanned</code><br><div class="outline-text-5" id="text-orgc25fad7">
<p>
对重复结构的操作，使用 <code>span()</code> 配合 <code>quote::qoute_spanned!</code> 实现
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgdec9f69" class="outline-4">
<h4 id="orgdec9f69">quote: rust 代码模板</h4>
<div class="outline-text-4" id="text-orgdec9f69">
<p>
<a href="https://crates.io/crates/quote">quote</a> 的 <code>quote!</code> 宏可以将 rust 语法数据结构变成 <code>TokenStream</code>
</p>

<p>
<code>qoute_spanned!</code> 宏可以将重复结构中的一个元素单独操作。
</p>

<p>
qoute 的宏类似于 <code>macro_rules!</code> 只是把 <code>$</code> 换成  <code>#</code>
</p>
</div>
</div>
</div>
</div>

    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/macro/" rel="tag">macro</a></li>
            <li><a class="tag p-category" href="../../categories/rust/" rel="tag">rust</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../rust-c-ffi/" rel="prev" title="rust c ffi">Previous post</a>
            </li>
            <li class="next">
                <a href="../pblas-scalapack/" rel="next" title="PBLAS &amp; ScaLAPACK &amp; BLACS">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>

